import '../model/zekr_model.dart';

final Map<String, List<Zekr>> localDuaas = {
  "أدعية قرآنية": [
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      reference: "[البقرة - 201]",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      reference: ". [البقرة - 250].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      reference: ". [البقرة\\n', '- 286].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
      reference: ". [آل عمران - 8].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      reference: ". [آل عمران - 16].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء",
      reference: ". [آل عمران - 38].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
      reference: ". [آل عمران - 53].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَِ",
      reference: ". [آل عمران - 147].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ",
      reference: ". [آل عمران -  191-194].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      reference: ". [الأعراف - 23].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content: "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
      reference: ". [الأعراف - 47].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content: "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
      reference: ". [الأعراف - 126].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
      reference: ". [التوبة - 129].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
      reference: ". [يونس - 85-86].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ",
      reference: ". [هود - 47].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء",
      reference: ". [إبرهيم - 40].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      reference: ". [إبرهيم - 41].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا",
      reference: ". [الإسراء - 80].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
      reference: ". [الكهف - 10].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي",
      reference: ". [طه - 25-28].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content: "رَّبِّ زِدْنِي عِلْمًا",
      reference: ". [طه - 114].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
      reference: ". [الأنبياء - 87].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content: "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ",
      reference: ". [الأنبياء - 89].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
      reference: ". [المؤمنون - 97-98].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content:
          "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ",
      reference: ". [المؤمنون - 109].",
      description: "",
      count: "01",
    ),
    Zekr(
      category: "أدعية قرآنية",
      content: "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ'",
      reference: ". [المؤمنون - 118].",
      description: "",
      count: "01",
    ),
  ],
  "أدعية الأنبياء": [
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      reference: ". [الأعراف - 23].",
      description: "آدم علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا ",
      reference: ". [نوح - 28].",
      description: "نوح علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ (127) رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَا أُمَّةً مُسْلِمَةً لَكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ (128)",
      reference: ". [هود - 47].",
      description: "إبراهيم علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
      reference: ". [المؤمنون - 29].",
      description: "هود علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content: "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
      reference: "\". [الصافات - 100].",
      description: "أيوب علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content: "رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ",
      reference: ". [البقرة - 127-128].",
      description: "لوط علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
      reference: ". [إبراهيم - 40-41].",
      description: "يوسف علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "وَسِعَ رَبُّنَا كُلَّ شَيْءٍ عِلْماً عَلَى اللّهِ تَوَكَّلْنَا رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
      reference: ". [الشعراء - 83-85].",
      description: "شعيب علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content: "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي '",
      reference: ". [الممتحنة - 4-5].",
      description: "موسى علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
      reference: ". [هود - 56].",
      description: "سليمان علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          " لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
      reference: ". [العنكبوت - 30].",
      description: "يونس علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content:
          "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء",
      reference: ". [الشعراء - 169].",
      description: "زكريا علية السلام.",
      count: "01",
    ),
    Zekr(
      category: "أدعية الأنبياء",
      content: "إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ",
      reference: ". [يوسف - 101].",
      description: "يعقوب علية السلام.",
      count: "01",
    ),
  ],
};
